Repository: mindsers/mindsersit-website
Catalog: src/locale/messages.*.xlf
Languages: fr

source: This is the default popin. You might have forgotten to customize your popin.
fr: Ceci est la popin par défaut. Vous avez peut-être oublié de paramétrer votre popin.

source: An error occured. We are unable to open the resume.
fr: Il y a eu une erreur. Nous ne somme pas capable d'ouvrir le CV.

source: An error occured when trying to send the message.
fr: Nous avons rencontré une erreur pendant l'envoie du message.

source: Your message has been send.
fr: Votre message a été correctement envoyé.

source: Leave me a message
fr: Ecrivez-moi

source: If you want to send me a message, an offer or a partnership, <br/> please use this form.
fr: Si vous souhaitez m'écrire, m'envoyer une offre ou une demande de partenariat, <br/>merci d'utiliser ce formulaire.

source: Name
fr: Nom

source: Your name is required.
fr: Votre nom est requis.

source: Email
fr: Adresse mail

source: Your email is required.
fr: Votre adresse mail est requise.

source: You need to enter a valid address email.
fr: L'adresse email doit être valide.

source: Subject
fr: Objet

source: The subject of your message is required.
fr: Vous devez remplir l'objet du message.

source: Your message is required.
fr: Vous devez écrire un message.

source: <span>*</span> All fields are required.
fr: <span>*</span> Tous les champs sont requis.

source: Send
fr: Envoyer

source: Resume
fr: CV

source: Shop
fr: Boutique

source: More links
fr: Plus de liens

source: Contact me
fr: Me contacter

source: Social
fr: Réseaux sociaux

source: Support
fr: Soutenir

source: ©2014 Nathanaël Cherrier. All rights reserved. <br/> <a>Legal notices</a>
fr: ©2014 Nathanaël Cherrier. Tous droits réservés. <br/> <a>Mentions légales</a>

source: Lead JavaScript and<br/>iOS developer
fr: Lead JavaScript et <br/> développeur iOS

source: Social
fr: Réseaux sociaux

source: My professional experiences
fr: Mes expériences professionnelles

source: <ng-container>since</ng-container> {{ exp.duration.start }} {{ exp.duration.end ? '- ' + exp.duration.end : '' }}
fr: <ng-container>depuis</ng-container> {{ exp.duration.start }} {{ exp.duration.end ? '- ' + exp.duration.end : '' }}

source: For <a>{{ exp.company }}</a> <ng-container>{{ exp.company }}</ng-container> at {{ exp.location }}
fr: Pour <a>{{ exp.company }}</a> <ng-container>{{ exp.company }}</ng-container> à {{ exp.location }}

source: No experiences to show. Maybe webservices don't work as exepected.
fr: Aucune expérience disponible. Le site rencontre peut-être un problème.

source: <ng-container>More</ng-container><ng-container>Less</ng-container> experiences
fr: <ng-container>Plus</ng-container><ng-container>Moins</ng-container> d'expériences

source: My studies
fr: Mes études

source: From {{ study.school }} at {{ study.location }}
fr: De {{ study.school }} à {{ study.location }}

source: No study informations to show. Maybe webservices don't work as exepected.
fr: Aucune information disponible. Le site rencontre peut-être un problème.

source: My skills
fr: Mes compétences

source: No skill to show. Maybe webservices don't work as exepected.
fr: Aucune information disponible. Le site rencontre peut-être un problème.

source: Other details you may want to know
fr: Autres informations qui pourraient vous intéresser

source: My second passion, right after development, is science. Especially stars' science ( astrophysics and cosmology) and life sciences (biology).
fr: Ma deuxième passion, juste après le développement, c'est la science. Plus spécifiquement l'astrophysique, la cosmologie et la biologie.

source: If you mix these two passions, you get bio-informatics. I never tried it but it looks really appealing.
fr: En mélangeant ces deux passions, on arrive à la bio-informatique. Je n'ai jamais essayé mais ça m'attire vraiment.

source: Besides that, I really like swimming (but I don't practice it very much) and I write a few blog posts. I play the guitar and a little bit of piano when I feel like it.
fr: A part ça, j'aime beaucoup nager (bien que je pratique peu) et écrire des articles de blog. Je joue de la guitare et un peu de piano.

source: The information on this web or PDF version of my resume are updated regularly but the PDF version is not exactly the same. For evident reasons, the PDF resume is shorter and less detailed than the web version, some information might not appear there.
fr: Les informations contenues sur ce site ou la version PDF de mon CV sont mises à jour régulièrement. La version PDF est cependant moins détaillées et plus courtes pour des raisons pratiques. Certaines des informations n'y apparaîssent donc pas.

source: Download the PDF version
fr: Télecharger la version PDF

source: Hi, my name is <strong>Nathanaël Cherrier</strong>, I am a Javascript/iOS developer, teacher, blogger, and an aspiring technical expert living in Lyon. Coding has been my passion for 13 years and I am always eager to learn more about new technologies and to better myself. I have a lead developer position in a startup where I code, of course, but also teach other about good practices and Javascript/Angular/Swift.
fr: Salut, je m'appelle <strong>Nathanaël Cherrier</strong>, je suis développeur Javascript/iOS, prof, blogueur, expert technique en devenir et j'habite à Lyon. Je me passionne pour le développement depuis 13 ans et je ne me lasse jamais d’en apprendre toujours plus sur les technologies et les moyens d’améliorer mon code. Je suis actuellement lead développeur dans une startup où je développe, bien sûr, mais j’enseigne également aux autres les bonnes pratiques ainsi que les languages JavaScript, Angular et Swift.

source: Learn more
fr: En savoir plus

source: <img/> {{ instagramFollowersCount || '4k+' }} followers
fr: <img/> {{ instagramFollowersCount || '4k+' }} abonnés

source: I have an <a>instagram account</a> where I share my life as a developer. My audience is international and I'll be glad to use it to help you reach out more people with your company! I am willing to promote your products/brands if I like them and they suit my account guidelines.
fr: J'ai un<a> compte Instagram</a> où je partage ma vie de développeur. Mon audience est internationale et je serais ravi de l'utiliser pour vous aider à donner de la visibilité à votre entreprise! Je peux promouvoir vos produits/votre marque si je les apprécie et qu'ils suivent ma ligne éditoriale.

source: For detailed pricing, <a>please contact me</a>.
fr: Pour plus d'informations concernant les prix, <a>contactez-moi</a>.

source: {{ postCount }} tech posts
fr: {{ postCount }} articles techniques

source: {{ ossProjectCount }} OSS maintained
fr: {{ ossProjectCount }} OSS maintenus

source: As a passionate developer, I pour my heart into giving back to open source. I learned most of what I know thanks to the open internet, so it feels normal for me to teach and help on the internet. I use open source projects every single day so contributing to open source projects feels like a good way to show how grateful I am for everyone maintaining projects.
fr: En tant que développeur, je suis vraiment passionné par ce que je fais et cela me tient vraiment à coeur de contribuer à l'open source. J'ai appris la plupart de tout ce que je sais grâce au contenu open source donc il me semble normal d'aider et d'enseigner à mon tour par ce biais. J'utilise des projets open source tous les jours donc ma contribution permet de montrer ma gratitude envers tout ceux qui maintiennent également des projets open source.

source: Currently, I write 1 to 2 posts a week in average, I contribute to several open source projects and I'm the maintainer of {{ ossProjectCount }} of them.
fr: A l'heure actuelle, j'écris entre 1 et 2 articles par semaine, je contribue à plusieurs projets open source et j'en maintiens {{ ossProjectCount }}.

source: If you want to know how to support my projects, please click down below.
fr: Pour en savoir plus sur les moyens de soutenir mon blog, vous pouvez cliquer sur le lien ci-dessous.

source: Oups! It seems like we didn't find what you want.
fr: Oups! On dirait bien que nous n'arrivons pas à trouver ce que vous voulez voir.

source: An unknown error occured. Sorry for trouble.
fr: Une erreur inconnue s'est produite. Excusez-nous pour le dérangement.

# support-page.title
source: Support my work
fr: Soutenir mes projets

source: <p>Did you find something helpful on the blog and are feeling a little grateful today?</p> <p> I have been coding for 15+ years and love using this blog to show what I learned during this continuous process of being a developper! I work full-time so this blog and my open source projects are mainly updated on my free time which is, as a dad and husband, very precious. </p> <p> I love to share with you what I learn everyday for <strong>free</strong> and I am trying my best to keep it this way, though costs are getting higher for me and I wouldn't say no to a little help from you. <br/> Your support would mean I could take days off or make more room in my schedule <strong>to offer you better quality content more often</strong>. </p> <p>As I don't want my website to turn into an ugly mess, you can see there no ads at all here!</p>
fr: <p>Avez-vous lu quelque chose qui vous a aidé sur le blog aujourd'hui? Si vous souhaitez montrer votre reconnaissance, c'est par ici. </p> <p> Je développe depuis plus de 15 ans et j'adore utiliser mon blog pour partager avec vous tout ce que j'apprends à ce sujet. Je travaille à plein temps donc j'écris des articles et je travaille sur mes projets open source sur mon temps libre qui, puisque j'ai une femme et une petite fille, est bien précieux. </p> <p> J'apprécie de pouvoir partager tout cela avec vous <strong>gratuitement</strong> et je fais tout pour que ça le reste, mais les coûts de maintien étant de plus en plus importants, je ne saurai refuser l'aide que vous pourrez m'apporter. <br/> Vos contributions me permetteront de poser quelques jours de congés par mois ou d'organiser mon emploi du temps différemment pour pouvoir produire<strong>plus de contenu en maintenant la qualité</strong>. </p>

source: It's often hard for people to figure out what is part of my daily workload. So, here what I do:
fr: Les gens me demandent souvent ce que je fais de mes journées donc voilà un petit récapitulatif :

source: I share my knowledge on <a>my blog</a> in the form of tech posts, tech event reports, product reviews and tutorials.
fr: Je partage mes connaissances sur <a>le blog</a> en écrivant des articles techniques, des recap d'events tech, des revues de produits et des tutoriels.

source: https://blog.nathanaelcherrier.com/en/
fr: https://blog.nathanaelcherrier.com/fr/

source: I document my life on <a>Instagram</a>. You'll find motivational posts, "dev life" posts, and friendly advice for newbies.
fr: Je documente ma vie de dev sur <a>Instagram</a>. Vous trouverez des posts pour vous motiver, sur la vie de dev en général et des conseils pour les débutants.

source: I maintain several open source projects on <a>Github</a>.
fr: Je maintiens plusieurs projet open source sur <a>Github</a>.

source: <strong>I am very grateful</strong> for the community I have build with this platform and all the emails you guys send me telling me how my posts or projects helped in some ways.
fr: <strong>Je suis vraiment reconnaissant</strong> pour la communauté qui s'est créée autour de ce blog et pour tous les emails que je reçois de votre part me disant que tel ou tel articles ou projets vous a aidé de quelque façon.

source: Here are a few ways you can support the blog.
fr: Voilà quelques moyens de soutenir le blog.

source: Patreon is an opportunity for you to support me and get a little something in exchange. You can see the rewards available directly on my Patreon page. It can last for as long as you desire for a minimum of 1$/month.
fr: Patreon est une opportunité pour vous de soutenir le blog tout en recevant quelque chose en échange. Vous pouvez voir les offres disponibles directement sur ma page Patreon. C'est à partir de 1$/mois et pour la durée de votre choix.

source: Donate with Patreon and get rewards
fr: Contribuer via Patreon

source: Become a patron button
fr: Bouton "Devenir un patron"

source: One-shot payment
fr: Contribution ponctuelle

source: If you don't want to be committed to a monthly subscription, you can also donate by Paypal or directly with your credit card.
fr: Si vous ne voulez pas être engagé sur un contribution mensuelle, vous pouvez aussi faire un paiement ponctuel par Paypal ou directement avec votre carte bancaire.

source: Donate with Paypal or by credit card
fr: Contribuer avec Paypal ou par carte bancaire

source: Donate with PayPal button
fr: Bouton "Contribuer avec Paypal"

source: Crypto-currencies
fr: Crypto-monnaies

source: If you feel a little nerdy (I am SO nerdy), you can also contribute to the blog by using your crypto-currencies. The website supports Litecoin, Bitcoin, Ethereum and Ripple.
fr: Et si vous êtes un peu geek (comme moi), vous pouvez aussi utiliser vos crypto-monnaies pour soutenir le blog. Vous pouvez contribuer via Litecoin, Bitcoin, Ethereum ou Ripple.

source: You can also send some Basic Atention Token (BAT) using the Brave browser. It is easier and secure. You just have <a>to install the browser</a> and start using it. When you are on my website you can choose to send a tip to me by clicking on the icon of BAT in the address bar. <a>Here is a video</a> to better show you how to do so.
fr: Vous pouvez aussi m'envoyer quelques Basic Atention Token (BAT) depuis le navigateur Brave. C'est simple et sécurisé. Vous avez juste à <a>installer le navigateur</a> et commencer à l'utiliser. Lorsque vous êtes sur mon site, vous pouvez choisir de faire une contribution en cliquant sur l'icone de BAT dans la barre d'adresse. <a>Voici une vidéo</a> qui montre mieux comment faire.

source: Can't support my blog with money? Please do share on social media the posts you appreciate! It helps tremendously.
fr: Vous ne pouvez pas contribuer financièrement ? N'hésitez pas à partager les articles que vous aimez sur les réseaux sociaux ! Ça aide vraiment.

source: Legal notices
fr: Mentions légales

source: Editor
fr: Éditeur

source: The website "nathanaelcherrier.com" is edited by the company <strong>MindsersIT</strong>.
fr: Le site &quot;nathanaelcherrier.com&quot; est édité par la société <strong>MindsersIT</strong>.

source: Legal structure: "Profession libérale"<br/> RCS de Lyon n°SIREN 841 104 052
fr: Structure juridique: &quot;Profession libérale&quot;<br/> RCS de Lyon n°SIREN 841 104 052

source: 155b rue Marcel Merieux - 69007 Lyon - France<br/> + 33 (0) 6 58 62 44 21<br/> <a>Contact email</a>
fr: 155b rue Marcel Merieux - 69007 Lyon - France<br/> + 33 (0) 6 58 62 44 21<br/> <a>E-mail de contact</a>

source: Publishing Director
fr: Directeur de publication

source: Mr. Nathanaël Cherrier
fr: M. Nathanaël Cherrier

source: Host
fr: Hébergeur

source: The website is hosted by OVH, SAS
fr: Ce site est hébergé par OVH, SAS
